Resources/recordings/garethp/ews/Test/Contacts/ContactsAPITest.testDeleteContactField.json

[{"error":false,"statusCode":200,"headers":{"Cache-Control":["private"],"Transfer-Encoding":["chunked"],"Content-Type":["text\/xml; charset=utf-8"],"Server":["Microsoft-IIS\/10.0"],"request-id":["3d6568a7-818a-4dbf-a8a7-f0c0888f5ed1"],"X-CalculatedFETarget":["DM5PR2201CU004.internal.outlook.com"],"X-BackEndHttpStatus":["200","200"],"Set-Cookie":["exchangecookie=679b032973a44647a60b738e86d827a5; expires=Fri, 15-Feb-2019 13:00:13 GMT; path=\/; HttpOnly"],"X-FEProxyInfo":["DM5PR2201CA0068.NAMPRD22.PROD.OUTLOOK.COM"],"X-CalculatedBETarget":["DM5PR1701MB1723.namprd17.prod.outlook.com"],"x-EwsHandler":["FindFolder"],"X-AspNet-Version":["4.0.30319"],"X-DiagInfo":["DM5PR1701MB1723"],"X-BEServer":["DM5PR1701MB1723"],"X-FEServer":["DM5PR2201CA0068","VI1PR0302CA0013"],"X-Powered-By":["ASP.NET"],"Date":["Thu, 15 Feb 2018 13:00:12 GMT"]},"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><s:Header><h:ServerVersionInfo MajorVersion=\"15\" MinorVersion=\"20\" MajorBuildNumber=\"485\" MinorBuildNumber=\"14\" Version=\"V2018_01_08\" xmlns:h=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\"\/><\/s:Header><s:Body><m:FindFolderResponse xmlns:m=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/messages\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xmlns:t=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\"><m:ResponseMessages><m:FindFolderResponseMessage ResponseClass=\"Success\"><m:ResponseCode>NoError<\/m:ResponseCode><m:RootFolder TotalItemsInView=\"8\" IncludesLastItemInRange=\"true\"><t:Folders><t:ContactsFolder><t:FolderId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMAAuAAAAAABkj\/k1VPf9SpGo4BGTcGawAQBu82DT7AULT56Wlc2HZmBAAAAAB1jEAAA=\" ChangeKey=\"AwAAABYAAABu82DT7AULT56Wlc2HZmBAAADh61QM\"\/><t:ParentFolderId Id=\"AQMkADE3NTZhYzA4LTZmODAtNGNjADctODRlNy02MWI5MWE1OGE0ZjAALgAAA2SP+TVU9\/1KkajgEZNwZrABAG7zYNPsBQtPnpaVzYdmYEAAAAIBDgAAAA==\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.MOC.ImContactList<\/t:FolderClass><t:DisplayName>{A9E2BC46-B3A0-4243-B315-60D991004455}<\/t:DisplayName><t:TotalCount>3<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMAAuAAAAAABkj\/k1VPf9SpGo4BGTcGawAQBu82DT7AULT56Wlc2HZmBAAAAAB1jHAAA=\" ChangeKey=\"AwAAABYAAABu82DT7AULT56Wlc2HZmBAAADh61QP\"\/><t:ParentFolderId Id=\"AQMkADE3NTZhYzA4LTZmODAtNGNjADctODRlNy02MWI5MWE1OGE0ZjAALgAAA2SP+TVU9\/1KkajgEZNwZrABAG7zYNPsBQtPnpaVzYdmYEAAAAIBDgAAAA==\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.Company<\/t:FolderClass><t:DisplayName>Companies<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMAAuAAAAAABkj\/k1VPf9SpGo4BGTcGawAQBu82DT7AULT56Wlc2HZmBAAAAAB1ikAAA=\" ChangeKey=\"AwAAABYAAABu82DT7AULT56Wlc2HZmBAAADh61QF\"\/><t:ParentFolderId Id=\"AQMkADE3NTZhYzA4LTZmODAtNGNjADctODRlNy02MWI5MWE1OGE0ZjAALgAAA2SP+TVU9\/1KkajgEZNwZrABAG7zYNPsBQtPnpaVzYdmYEAAAAIBDgAAAA==\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.GalContacts<\/t:FolderClass><t:DisplayName>GAL Contacts<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMAAuAAAAAABkj\/k1VPf9SpGo4BGTcGawAQBu82DT7AULT56Wlc2HZmBAAAAAB1jGAAA=\" ChangeKey=\"AwAAABYAAABu82DT7AULT56Wlc2HZmBAAADh61QO\"\/><t:ParentFolderId Id=\"AQMkADE3NTZhYzA4LTZmODAtNGNjADctODRlNy02MWI5MWE1OGE0ZjAALgAAA2SP+TVU9\/1KkajgEZNwZrABAG7zYNPsBQtPnpaVzYdmYEAAAAIBDgAAAA==\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.OrganizationalContacts<\/t:FolderClass><t:DisplayName>Organizational Contacts<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMAAuAAAAAABkj\/k1VPf9SpGo4BGTcGawAQBu82DT7AULT56Wlc2HZmBAAAAAB1jFAAA=\" ChangeKey=\"AwAAABYAAABu82DT7AULT56Wlc2HZmBAAADh61QN\"\/><t:ParentFolderId Id=\"AQMkADE3NTZhYzA4LTZmODAtNGNjADctODRlNy02MWI5MWE1OGE0ZjAALgAAA2SP+TVU9\/1KkajgEZNwZrABAG7zYNPsBQtPnpaVzYdmYEAAAAIBDgAAAA==\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.PeopleCentricConversationBuddies<\/t:FolderClass><t:DisplayName>PeopleCentricConversation Buddies<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMAAuAAAAAABkj\/k1VPf9SpGo4BGTcGawAQBu82DT7AULT56Wlc2HZmBAAAAAB1ihAAA=\" ChangeKey=\"AwAAABYAAABu82DT7AULT56Wlc2HZmBAAAErKYFK\"\/><t:ParentFolderId Id=\"AQMkADE3NTZhYzA4LTZmODAtNGNjADctODRlNy02MWI5MWE1OGE0ZjAALgAAA2SP+TVU9\/1KkajgEZNwZrABAG7zYNPsBQtPnpaVzYdmYEAAAAIBDgAAAA==\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.RecipientCache<\/t:FolderClass><t:DisplayName>Recipient Cache<\/t:DisplayName><t:TotalCount>159<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMAAuAAAAAABkj\/k1VPf9SpGo4BGTcGawAQBu82DT7AULT56Wlc2HZmBAAAAAB1jDAAA=\" ChangeKey=\"AwAAABYAAABu82DT7AULT56Wlc2HZmBAAADh61QL\"\/><t:ParentFolderId Id=\"AQMkADE3NTZhYzA4LTZmODAtNGNjADctODRlNy02MWI5MWE1OGE0ZjAALgAAA2SP+TVU9\/1KkajgEZNwZrABAG7zYNPsBQtPnpaVzYdmYEAAAAIBDgAAAA==\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.MOC.QuickContacts<\/t:FolderClass><t:DisplayName>Skype for Business Contacts<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMAAuAAAAAABkj\/k1VPf9SpGo4BGTcGawAQBu82DT7AULT56Wlc2HZmBAAADnzGxtAAA=\" ChangeKey=\"AwAAABYAAABu82DT7AULT56Wlc2HZmBAAADomVRQ\"\/><t:ParentFolderId Id=\"AQMkADE3NTZhYzA4LTZmODAtNGNjADctODRlNy02MWI5MWE1OGE0ZjAALgAAA2SP+TVU9\/1KkajgEZNwZrABAG7zYNPsBQtPnpaVzYdmYEAAAAIBDgAAAA==\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact<\/t:FolderClass><t:DisplayName>Test<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><\/t:Folders><\/m:RootFolder><\/m:FindFolderResponseMessage><\/m:ResponseMessages><\/m:FindFolderResponse><\/s:Body><\/s:Envelope>"},{"error":false,"statusCode":200,"headers":{"Cache-Control":["private"],"Transfer-Encoding":["chunked"],"Content-Type":["text\/xml; charset=utf-8"],"Server":["Microsoft-IIS\/10.0"],"request-id":["d5c43460-9502-4515-b01a-27c11706fd9c"],"X-CalculatedFETarget":["DM5PR2201CU004.internal.outlook.com"],"X-BackEndHttpStatus":["200","200"],"Set-Cookie":["exchangecookie=cad419a4e9804a1688bbe64caa9fd16e; expires=Fri, 15-Feb-2019 13:00:13 GMT; path=\/; HttpOnly"],"X-FEProxyInfo":["DM5PR2201CA0068.NAMPRD22.PROD.OUTLOOK.COM"],"X-CalculatedBETarget":["DM5PR1701MB1723.namprd17.prod.outlook.com"],"x-EwsHandler":["CreateItem"],"X-AspNet-Version":["4.0.30319"],"X-DiagInfo":["DM5PR1701MB1723"],"X-BEServer":["DM5PR1701MB1723"],"X-FEServer":["DM5PR2201CA0068","VI1PR0302CA0013"],"X-Powered-By":["ASP.NET"],"Date":["Thu, 15 Feb 2018 13:00:13 GMT"]},"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><s:Header><h:ServerVersionInfo MajorVersion=\"15\" MinorVersion=\"20\" MajorBuildNumber=\"485\" MinorBuildNumber=\"14\" Version=\"V2018_01_08\" xmlns:h=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\"\/><\/s:Header><s:Body><m:CreateItemResponse xmlns:m=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/messages\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xmlns:t=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\"><m:ResponseMessages><m:CreateItemResponseMessage ResponseClass=\"Success\"><m:ResponseCode>NoError<\/m:ResponseCode><m:Items><t:Contact><t:ItemId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMABGAAAAAABkj\/k1VPf9SpGo4BGTcGawBwBu82DT7AULT56Wlc2HZmBAAADnzGxtAABu82DT7AULT56Wlc2HZmBAAAEq7ZWnAAA=\" ChangeKey=\"EQAAABYAAABu82DT7AULT56Wlc2HZmBAAAErKWRZ\"\/><\/t:Contact><\/m:Items><\/m:CreateItemResponseMessage><\/m:ResponseMessages><\/m:CreateItemResponse><\/s:Body><\/s:Envelope>"},{"error":false,"statusCode":200,"headers":{"Cache-Control":["private"],"Transfer-Encoding":["chunked"],"Content-Type":["text\/xml; charset=utf-8"],"Server":["Microsoft-IIS\/10.0"],"request-id":["aef5dbfd-3436-421f-af72-0ae40a72c8af"],"X-CalculatedFETarget":["DM5PR2201CU004.internal.outlook.com"],"X-BackEndHttpStatus":["200","200"],"Set-Cookie":["exchangecookie=9c91b188c8af4939b159ce93ab67e6ab; expires=Fri, 15-Feb-2019 13:00:13 GMT; path=\/; HttpOnly"],"X-FEProxyInfo":["DM5PR2201CA0068.NAMPRD22.PROD.OUTLOOK.COM"],"X-CalculatedBETarget":["DM5PR1701MB1723.namprd17.prod.outlook.com"],"x-EwsHandler":["UpdateItem"],"X-AspNet-Version":["4.0.30319"],"X-DiagInfo":["DM5PR1701MB1723"],"X-BEServer":["DM5PR1701MB1723"],"X-FEServer":["DM5PR2201CA0068","VI1PR0302CA0013"],"X-Powered-By":["ASP.NET"],"Date":["Thu, 15 Feb 2018 13:00:13 GMT"]},"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><s:Header><h:ServerVersionInfo MajorVersion=\"15\" MinorVersion=\"20\" MajorBuildNumber=\"485\" MinorBuildNumber=\"14\" Version=\"V2018_01_08\" xmlns:h=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\"\/><\/s:Header><s:Body><m:UpdateItemResponse xmlns:m=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/messages\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xmlns:t=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\"><m:ResponseMessages><m:UpdateItemResponseMessage ResponseClass=\"Success\"><m:ResponseCode>NoError<\/m:ResponseCode><m:Items><t:Contact><t:ItemId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMABGAAAAAABkj\/k1VPf9SpGo4BGTcGawBwBu82DT7AULT56Wlc2HZmBAAADnzGxtAABu82DT7AULT56Wlc2HZmBAAAEq7ZWnAAA=\" ChangeKey=\"EQAAABYAAABu82DT7AULT56Wlc2HZmBAAAErKWRa\"\/><\/t:Contact><\/m:Items><m:ConflictResults><t:Count>0<\/t:Count><\/m:ConflictResults><\/m:UpdateItemResponseMessage><\/m:ResponseMessages><\/m:UpdateItemResponse><\/s:Body><\/s:Envelope>"},{"error":false,"statusCode":200,"headers":{"Cache-Control":["private"],"Transfer-Encoding":["chunked"],"Content-Type":["text\/xml; charset=utf-8"],"Server":["Microsoft-IIS\/10.0"],"request-id":["ef368469-56c8-43ec-8c51-ebfe19147fbe"],"X-CalculatedFETarget":["DM5PR2201CU004.internal.outlook.com"],"X-BackEndHttpStatus":["200","200"],"Set-Cookie":["exchangecookie=e9afddf7eaca45d3a0b1b35e291d7011; expires=Fri, 15-Feb-2019 13:00:14 GMT; path=\/; HttpOnly"],"X-FEProxyInfo":["DM5PR2201CA0068.NAMPRD22.PROD.OUTLOOK.COM"],"X-CalculatedBETarget":["DM5PR1701MB1723.namprd17.prod.outlook.com"],"x-EwsHandler":["GetItem"],"X-AspNet-Version":["4.0.30319"],"X-DiagInfo":["DM5PR1701MB1723"],"X-BEServer":["DM5PR1701MB1723"],"X-FEServer":["DM5PR2201CA0068","VI1PR0302CA0013"],"X-Powered-By":["ASP.NET"],"Date":["Thu, 15 Feb 2018 13:00:13 GMT"]},"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><s:Header><h:ServerVersionInfo MajorVersion=\"15\" MinorVersion=\"20\" MajorBuildNumber=\"485\" MinorBuildNumber=\"14\" Version=\"V2018_01_08\" xmlns:h=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\"\/><\/s:Header><s:Body><m:GetItemResponse xmlns:m=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/messages\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xmlns:t=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\"><m:ResponseMessages><m:GetItemResponseMessage ResponseClass=\"Success\"><m:ResponseCode>NoError<\/m:ResponseCode><m:Items><t:Contact><t:ItemId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMABGAAAAAABkj\/k1VPf9SpGo4BGTcGawBwBu82DT7AULT56Wlc2HZmBAAADnzGxtAABu82DT7AULT56Wlc2HZmBAAAEq7ZWnAAA=\" ChangeKey=\"EQAAABYAAABu82DT7AULT56Wlc2HZmBAAAErKWRa\"\/><t:ParentFolderId Id=\"AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMAAuAAAAAABkj\/k1VPf9SpGo4BGTcGawAQBu82DT7AULT56Wlc2HZmBAAADnzGxtAAA=\" ChangeKey=\"AQAAAA==\"\/><t:ItemClass>IPM.Contact<\/t:ItemClass><t:Subject>Smith<\/t:Subject><t:Sensitivity>Normal<\/t:Sensitivity><t:Body BodyType=\"Text\"\/><t:DateTimeReceived>2018-02-15T13:00:13Z<\/t:DateTimeReceived><t:Size>7200<\/t:Size><t:Importance>Normal<\/t:Importance><t:IsSubmitted>false<\/t:IsSubmitted><t:IsDraft>true<\/t:IsDraft><t:IsFromMe>false<\/t:IsFromMe><t:IsResend>false<\/t:IsResend><t:IsUnmodified>false<\/t:IsUnmodified><t:DateTimeSent>2018-02-15T13:00:13Z<\/t:DateTimeSent><t:DateTimeCreated>2018-02-15T13:00:13Z<\/t:DateTimeCreated><t:DisplayCc\/><t:DisplayTo\/><t:HasAttachments>false<\/t:HasAttachments><t:Culture>en-US<\/t:Culture><t:EffectiveRights><t:CreateAssociated>false<\/t:CreateAssociated><t:CreateContents>false<\/t:CreateContents><t:CreateHierarchy>false<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><t:LastModifiedName>Gareth Parker<\/t:LastModifiedName><t:LastModifiedTime>2018-02-15T13:00:14Z<\/t:LastModifiedTime><t:IsAssociated>false<\/t:IsAssociated><t:WebClientReadFormQueryString>https:\/\/outlook.office365.com\/owa\/?ItemID=AAMkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMABGAAAAAABkj%2Fk1VPf9SpGo4BGTcGawBwBu82DT7AULT56Wlc2HZmBAAADnzGxtAABu82DT7AULT56Wlc2HZmBAAAEq7ZWnAAA%3D&amp;exvsurl=1&amp;viewmodel=PersonaCardViewModelFactory<\/t:WebClientReadFormQueryString><t:ConversationId Id=\"AAQkADE3NTZhYzA4LTZmODAtNGNjNy04NGU3LTYxYjkxYTU4YTRmMAAQAA1MuCa4TvFArYgN4gREg0k=\"\/><t:FileAs\/><t:FileAsMapping>None<\/t:FileAsMapping><t:DisplayName>Smith<\/t:DisplayName><t:CompleteName><t:LastName>Smith<\/t:LastName><t:FullName>Smith<\/t:FullName><\/t:CompleteName><t:EmailAddresses><t:Entry Key=\"EmailAddress1\" Name=\"john.smith@gmail.com\" RoutingType=\"SMTP\" MailboxType=\"Contact\">john.smith@gmail.com<\/t:Entry><\/t:EmailAddresses><t:PhysicalAddresses><t:Entry Key=\"Business\"><t:Street>123 Street<\/t:Street><t:State>123 State<\/t:State><\/t:Entry><\/t:PhysicalAddresses><t:Surname>Smith<\/t:Surname><t:AccountName>ibC3TLhCpUVzjj4sMd7CXx35PCw=<\/t:AccountName><t:ObjectId>98c1360bdfca4baeaf134189870fd70e<\/t:ObjectId><t:SourceId>EXCH<\/t:SourceId><\/t:Contact><\/m:Items><\/m:GetItemResponseMessage><\/m:ResponseMessages><\/m:GetItemResponse><\/s:Body><\/s:Envelope>"},{"error":false,"statusCode":200,"headers":{"Cache-Control":["private"],"Transfer-Encoding":["chunked"],"Content-Type":["text\/xml; charset=utf-8"],"Server":["Microsoft-IIS\/10.0"],"request-id":["baedc4cf-2e66-48a7-b417-c03ccf6fe819"],"X-CalculatedFETarget":["DM5PR2201CU004.internal.outlook.com"],"X-BackEndHttpStatus":["200","200"],"Set-Cookie":["exchangecookie=2e252a5e3aaf4231b8ab28b636306744; expires=Fri, 15-Feb-2019 13:00:14 GMT; path=\/; HttpOnly"],"X-FEProxyInfo":["DM5PR2201CA0068.NAMPRD22.PROD.OUTLOOK.COM"],"X-CalculatedBETarget":["DM5PR1701MB1723.namprd17.prod.outlook.com"],"x-EwsHandler":["DeleteItem"],"X-AspNet-Version":["4.0.30319"],"X-DiagInfo":["DM5PR1701MB1723"],"X-BEServer":["DM5PR1701MB1723"],"X-FEServer":["DM5PR2201CA0068","VI1PR0302CA0013"],"X-Powered-By":["ASP.NET"],"Date":["Thu, 15 Feb 2018 13:00:13 GMT"]},"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><s:Header><h:ServerVersionInfo MajorVersion=\"15\" MinorVersion=\"20\" MajorBuildNumber=\"485\" MinorBuildNumber=\"14\" Version=\"V2018_01_08\" xmlns:h=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\"\/><\/s:Header><s:Body><m:DeleteItemResponse xmlns:m=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/messages\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xmlns:t=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\"><m:ResponseMessages><m:DeleteItemResponseMessage ResponseClass=\"Success\"><m:ResponseCode>NoError<\/m:ResponseCode><\/m:DeleteItemResponseMessage><\/m:ResponseMessages><\/m:DeleteItemResponse><\/s:Body><\/s:Envelope>"}]